milling/easyMillLaminarSimpleFoam/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// General m4 macros

  
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// ************************************************************************* //
// Geometry constants - Shared among various m4 files 

// define(ygap, 0.01)           // length of air gap - works 
// define(ygap, 0.005)           // length of air gap - works 
// define(ygap, 0.02) // making the problem easier on purpose 
 // making gap large enough for mesh to work without refinement zones  
   
         // x-coordinate of point on stator surface 
         // y-coordinate of point on stator surface 

     // y-coordinate of center of first refinement zone  
         // height of first refinement zone 
                   // y-coordinate of center of second refinement zone  
                   // height of second refinement zone 
 // y-coordinate of center of third refinement zone  
     // height of third refinement zone 
        // y-coordinate of center of fourth refinement zone  
                   // height of fourth refinement zone
// ************************************************************************* //

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxCellSize     0.01;
//maxCellSize     0.015;
maxCellSize     0.005;

// boundaryCellSize 0.01;

surfaceFile     "geom.fms";

boundaryLayers
{
    nLayers 2;

    // thicknessRatio 1.1;

    // maxFirstLayerThickness 0.5;

    patchBoundaryLayers
    {

       inlet
       {
         nLayers 0;
       }

       outlet
       {
         nLayers 0;
       }

       axis 
       {
         nLayers 0;
       }

//       stator1
//       {
//         nLayers 2;
//       }

    }
}

// ************************************************************************* //
