milling/easyMillLaminarSimpleFoam/system/meshDict.m4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// General m4 macros

changecom(//)changequote([,]) dnl>
define(calc, [esyscmd(perl -e 'use Math::Trig; print ($1)')]) dnl>

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
include(./geometry_constants)
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxCellSize     0.01;
//maxCellSize     0.015;
maxCellSize     0.025;

// boundaryCellSize 0.01;

surfaceFile     "geom.fms";

objectRefinements
{
    zone1refiment
    {
        type        box;
        additionalRefinementLevels 1; 
        centre      (0.125 ycr1 0.05);
        lengthX     0.25;
        lengthY     yhr1;
        lengthZ     0.1;
    }
}

objectRefinements
{
    zone2refiment
    {
        type        box;
        additionalRefinementLevels 2; 
        centre      (0.375 ycr2 0.05);
        lengthX     0.25;
        lengthY     yhr2;
        lengthZ     0.1;
    }
}

objectRefinements
{
    zone3refiment
    {
        type        box;
        additionalRefinementLevels 3;  
        centre      (0.75 ycr3 0.05);
        lengthX     0.5;
        lengthY     yhr3;
        lengthZ     0.1;
    }
}

objectRefinements
{
    zone4refiment
    {
        type        box;
        additionalRefinementLevels 4;    
        centre      (1.5 ycr4 0.05);
        lengthX     1.0;
        lengthY     yhr4;
        lengthZ     0.1;
    }
}

boundaryLayers
{
    nLayers 2;

    // thicknessRatio 1.1;

    // maxFirstLayerThickness 0.5;

    patchBoundaryLayers
    {

       inlet
       {
         nLayers 0;
       }

       outlet
       {
         nLayers 0;
       }

       axis 
       {
         nLayers 0;
       }

//       stator1
//       {
//         nLayers 2;
//       }

    }
}

// ************************************************************************* //
